---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures
source: html/049efa1a-080e-1a19-5d50-674be9e55052.htm
---
# BuiltInFailures.ForeignFileFailures Properties

This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.